xsh381503442/xsh/NRF52832/NRF52832/nRF5_SDK_14.1.0_1dda907/components/ble/ble_advertising/ble_advertising.c
/**@brief Function for starting directed slow advertising.
 *
 * @param[in]  p_advertising Advertising module instance.
 * @param[out] p_adv_params Advertising parameters.
 *
 * @return NRF_SUCCESS
 */
static ret_code_t set_adv_mode_directed_slow(ble_advertising_t * const p_advertising,
                                             ble_gap_adv_params_t    * p_adv_params)
{
    p_advertising->adv_evt = BLE_ADV_EVT_DIRECTED_SLOW;

    p_adv_params->p_peer_addr = &p_advertising->peer_address;
    p_adv_params->type        = BLE_GAP_ADV_TYPE_ADV_DIRECT_IND;
    p_adv_params->timeout     = p_advertising->adv_modes_config.ble_adv_directed_slow_timeout;
    p_adv_params->interval    = p_advertising->adv_modes_config.ble_adv_directed_slow_interval;

    return NRF_SUCCESS;
}


/**@brief Function for starting fast advertising.
 *
 * @param[in]  p_advertising Advertising module instance.
 * @param[out] p_adv_params Advertising parameters.
 *
 * @return NRF_SUCCESS or an error from @ref ble_advdata_set().
 */
static ret_code_t set_adv_mode_fast(ble_advertising_t * const p_advertising,
                                    ble_gap_adv_params_t    * p_adv_params)
{
    ret_code_t ret;

    p_adv_params->interval = p_advertising->adv_modes_config.ble_adv_fast_interval;
    p_adv_params->timeout  = p_advertising->adv_modes_config.ble_adv_fast_timeout;

    if ((p_advertising->adv_modes_config.ble_adv_whitelist_enabled) &&
        (!p_advertising->whitelist_temporarily_disabled) &&
        (whitelist_has_entries(p_advertising)))
    {
        #if (NRF_SD_BLE_API_VERSION <= 2)
            p_adv_params->p_whitelist = &m_whitelist;
        #endif

        p_adv_params->fp = BLE_GAP_ADV_FP_FILTER_CONNREQ;
        p_advertising->advdata.flags  = BLE_GAP_ADV_FLAG_BR_EDR_NOT_SUPPORTED;

        ret = ble_advdata_set(&(p_advertising->advdata), NULL);
        if (ret != NRF_SUCCESS)
        {
            return ret;
        }

        p_advertising->adv_evt = BLE_ADV_EVT_FAST_WHITELIST;
    }
    else
    {
        p_advertising->adv_evt = BLE_ADV_EVT_FAST;
    }

    return NRF_SUCCESS;
}


/**@brief Function for starting slow advertising.
 *
 * @param[in]  p_advertising Advertising module instance.
 * @param[out] p_adv_params Advertising parameters.
 *
 * @return NRF_SUCCESS or an error from @ref ble_advdata_set().
 */
static ret_code_t set_adv_mode_slow(ble_advertising_t * const p_advertising,
                                    ble_gap_adv_params_t    * p_adv_params)
{
    ret_code_t ret;

    p_adv_params->interval = p_advertising->adv_modes_config.ble_adv_slow_interval;
    p_adv_params->timeout  = p_advertising->adv_modes_config.ble_adv_slow_timeout;

    if ((p_advertising->adv_modes_config.ble_adv_whitelist_enabled) &&
        (!p_advertising->whitelist_temporarily_disabled) &&
        (whitelist_has_entries(p_advertising)))
    {
        #if (NRF_SD_BLE_API_VERSION <= 2)
        {
            p_adv_params->p_whitelist = &p_advertising->whitelist;
        }
        #endif

        p_adv_params->fp = BLE_GAP_ADV_FP_FILTER_CONNREQ;
        p_advertising->advdata.flags  = BLE_GAP_ADV_FLAG_BR_EDR_NOT_SUPPORTED;

        ret = ble_advdata_set(&(p_advertising->advdata), NULL);
        if (ret != NRF_SUCCESS)
        {
            return ret;
        }

        p_advertising->adv_evt = BLE_ADV_EVT_SLOW_WHITELIST;
    }
    else
    {
        p_advertising->adv_evt = BLE_ADV_EVT_SLOW;
    }

    return NRF_SUCCESS;
}


void ble_advertising_conn_cfg_tag_set(ble_advertising_t * const p_advertising,
                                      uint8_t                   ble_cfg_tag)
{
    p_advertising->conn_cfg_tag = ble_cfg_tag;
}


uint32_t ble_advertising_init(ble_advertising_t            * const p_advertising,
                              ble_advertising_init_t const * const p_init)
{
    uint32_t ret;
    if ((p_init == NULL) || (p_advertising == NULL))
    {
        return NRF_ERROR_NULL;
    }

    p_advertising->initialized                    = true;
    p_advertising->adv_mode_current               = BLE_ADV_MODE_IDLE;
    p_advertising->adv_modes_config               = p_init->config;
    p_advertising->conn_cfg_tag                   = BLE_CONN_CFG_TAG_DEFAULT;
    p_advertising->evt_handler                    = p_init->evt_handler;
    p_advertising->error_handler                  = p_init->error_handler;
    p_advertising->current_slave_link_conn_handle = BLE_CONN_HANDLE_INVALID;

    memset(&p_advertising->peer_address, 0, sizeof(p_advertising->peer_address));
    memset(&p_advertising->advdata,      0, sizeof(p_advertising->advdata));

    // Copy advertising data.
    p_advertising->advdata.name_type          = p_init->advdata.name_type;
    p_advertising->advdata.include_appearance = p_init->advdata.include_appearance;
    p_advertising->advdata.flags              = p_init->advdata.flags;
    p_advertising->advdata.short_name_len     = p_init->advdata.short_name_len;

    p_advertising->advdata.uuids_complete          = p_init->advdata.uuids_complete;
    p_advertising->advdata.uuids_more_available    = p_init->advdata.uuids_more_available;
    p_advertising->advdata.uuids_solicited         = p_init->advdata.uuids_solicited;
    p_advertising->advdata.include_ble_device_addr = p_init->advdata.include_ble_device_addr;

    if (p_init->advdata.p_manuf_specific_data != NULL)
    {
        p_advertising->advdata.p_manuf_specific_data   = &(p_advertising->manuf_specific_data);
        p_advertising->manuf_specific_data.data.p_data = p_advertising->manuf_data_array;
        p_advertising->advdata.p_manuf_specific_data->company_identifier =
            p_init->advdata.p_manuf_specific_data->company_identifier;
        p_advertising->advdata.p_manuf_specific_data->data.size = p_init->advdata.p_manuf_specific_data->data.size;

        for (uint32_t i = 0; i < p_advertising->advdata.p_manuf_specific_data->data.size; i++)
        {
            p_advertising->manuf_data_array[i] = p_init->advdata.p_manuf_specific_data->data.p_data[i];
        }
    }

    if (p_init->advdata.p_service_data_array != NULL)
    {
        p_advertising->service_data.data.p_data                   = p_advertising->service_data_array;
        p_advertising->advdata.p_service_data_array               = &(p_advertising->service_data);
        p_advertising->advdata.p_service_data_array->data.p_data  = p_advertising->service_data_array;
        p_advertising->advdata.p_service_data_array->data.size    = p_init->advdata.p_service_data_array->data.size;
        p_advertising->advdata.p_service_data_array->service_uuid = p_init->advdata.p_service_data_array->service_uuid;

        for (uint32_t i = 0; i < p_advertising->advdata.p_service_data_array->data.size; i++)
        {
            p_advertising->service_data_array[i] = p_init->advdata.p_service_data_array->data.p_data[i];
        }

        p_advertising->advdata.service_data_count = p_init->advdata.service_data_count;
    }

    if (p_init->advdata.p_slave_conn_int != NULL)
    {
        p_advertising->advdata.p_slave_conn_int                    = &(p_advertising->slave_conn_int);
        p_advertising->advdata.p_slave_conn_int->max_conn_interval = p_init->advdata.p_slave_conn_int->max_conn_interval;
        p_advertising->advdata.p_slave_conn_int->min_conn_interval = p_init->advdata.p_slave_conn_int->min_conn_interval;
    }

    if (p_init->advdata.p_tx_power_level != NULL)
    {
        p_advertising->advdata.p_tx_power_level = p_init->advdata.p_tx_power_level;
    }

