xsh381503442/xsh/NRF52832/NRF52832/nRF5_SDK_14.1.0_1dda907/components/ble/ble_advertising/ble_advertising.c
    #if (NRF_SD_BLE_API_VERSION <= 2)

        p_advertising->whitelist.addr_count = addr_cnt;
        p_advertising->whitelist.irk_count  = irk_cnt;

        for (uint32_t i = 0; i < addr_cnt; i++)
        {
            *p_advertising->whitelist.pp_addrs[i] = p_gap_addrs[i];
        }

        for (uint32_t i = 0; i < irk_cnt; i++)
        {
            *p_advertising->whitelist.pp_irks[i] = p_gap_irks[i];
        }

    #else

        p_advertising->whitelist_in_use = ((addr_cnt > 0) || (irk_cnt > 0));

    #endif

    return NRF_SUCCESS;
}


uint32_t ble_advertising_restart_without_whitelist(ble_advertising_t * const p_advertising)
{
    uint32_t ret;

    (void) sd_ble_gap_adv_stop();

    p_advertising->whitelist_temporarily_disabled = true;

    #if (NRF_SD_BLE_API_VERSION >= 3)
        p_advertising->whitelist_in_use = false;
    #endif

    p_advertising->advdata.flags = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;

    ret = ble_advdata_set(&(p_advertising->advdata), NULL);
    if (ret != NRF_SUCCESS)
    {
        return ret;
    }

    ret = ble_advertising_start(p_advertising, p_advertising->adv_mode_current);
    if ((ret != NRF_SUCCESS) && (p_advertising->error_handler != NULL))
    {
        p_advertising->error_handler(ret);
    }

    return NRF_SUCCESS;
}


void ble_advertising_modes_config_set(ble_advertising_t            * const p_advertising,
                                      ble_adv_modes_config_t const * const p_adv_modes_config)
{
    p_advertising->adv_modes_config = *p_adv_modes_config;
}

void ble_advertising_dev_name_update(uint8_t *p_data, uint8_t len)
{
	uint32_t                err_code;	
	ble_gap_conn_sec_mode_t sec_mode;
	BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);	
	err_code = sd_ble_gap_device_name_set(&sec_mode,
																				p_data,
																				len);
	APP_ERROR_CHECK(err_code);	
	err_code = ble_advdata_set(&m_advdata, &m_srdata);	
	APP_ERROR_CHECK(err_code);
}

#ifdef SOS_ADVERTISING 
#include "main.h"
#include "ble_types.h"
extern ble_uuid_t m_adv_uuids[BLE_UUID_ADV_COUNT];
void ble_advertising_sos_gps_update(uint8_t *p_data, uint8_t len)
{
	uint32_t                err_code;	

  memset(&m_advdata, 0, sizeof(m_advdata));
	memset(&m_srdata, 0, sizeof(m_srdata));

	m_advdata.name_type               = BLE_ADVDATA_FULL_NAME;
	m_advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;   

	ble_uuid_t adv_uuids[BLE_UUID_ADV_COUNT];
	memcpy(adv_uuids,m_adv_uuids,sizeof(adv_uuids));
	adv_uuids[2].uuid = 0xEEEE;
	
	m_advdata.uuids_complete.uuid_cnt = sizeof(adv_uuids) / sizeof(adv_uuids[0]);
	m_advdata.uuids_complete.p_uuids  = adv_uuids;	
	
	
	ble_advdata_service_data_t service_data_struct;
	m_srdata.p_service_data_array = &service_data_struct;    
	m_srdata.p_service_data_array->service_uuid = 0xEEEE;
	m_srdata.p_service_data_array->data.p_data = p_data;
	m_srdata.p_service_data_array->data.size   = len;
	m_srdata.service_data_count = 1;

	int8_t tx_power_level = 4;
	m_advdata.p_tx_power_level = &tx_power_level;
	m_srdata.p_tx_power_level = &tx_power_level;
		
	err_code = ble_advdata_set(&m_advdata, &m_srdata);	
	APP_ERROR_CHECK(err_code);
}
extern uint8_t	g_adv_manuf_mac[BLE_GAP_ADDR_LEN];
void ble_advertising_sos_gps_finish(void)
{
	uint32_t                err_code;	

	memset(&m_advdata, 0, sizeof(m_advdata));
	memset(&m_srdata, 0, sizeof(m_srdata));


	m_advdata.name_type               = BLE_ADVDATA_FULL_NAME;
	m_advdata.include_appearance      = false;
	m_advdata.flags                   = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;
	
	

	m_srdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
	m_srdata.uuids_complete.p_uuids  = m_adv_uuids;

	ble_advdata_manuf_data_t        manuf_data;
	manuf_data.company_identifier     = COMPANY_IDENTIFIER;
	manuf_data.data.size              = sizeof(g_adv_manuf_mac);
	manuf_data.data.p_data            = g_adv_manuf_mac;
	m_srdata.p_manuf_specific_data = &manuf_data;			
	

	int8_t tx_power_level = 4;
	m_advdata.p_tx_power_level = &tx_power_level;
	m_srdata.p_tx_power_level = &tx_power_level;
		

	err_code = ble_advdata_set(&m_advdata, &m_srdata);	
	APP_ERROR_CHECK(err_code);		

	
}
#endif



#endif // NRF_MODULE_ENABLED(BLE_ADVERTISING)
